{
  "Books":[
    {
      "Title": "Astrophysics for People in a Hurry",
      "ISBN": "0393609391",
      "Genre": "Science",
      "Publish Date": "May 2 2017",
      "Publisher": "WW Norton",
      "Review": "What is the nature of space and time? How do we fit within the universe? How does the universe fit within us? There’s no better guide through these mind-expanding questions than acclaimed astrophysicist and best-selling author Neil deGrasse Tyson. But today, few of us have time to contemplate the cosmos. So Tyson brings the universe down to Earth succinctly and clearly, with sparkling wit, in tasty chapters consumable anytime and anywhere in your busy day.",
      "Price": "19.80",
      "Book Type": "Hardcover",
      "Book Pages": "144",
      "Author": "Neil Degrasse Tyson",
      "Language": "English",
      "Bio": "Neil deGrasse Tyson is an astrophysicist with the American Museum of Natural History, director of its world-famous Hayden Planetarium, host of the hit radio and TV show StarTalk, and an award-winning author. He lives in New York City.",
      "img": "Astrophysics_for_People_in_a_Hurry.jpg"
    },
    {
      "Title": "C++ How to Program",
      "ISBN": "0131857576",
      "Genre": "Technology",
      "Publish Date": "Jan. 5 2005",
      "Publisher": "Pearson",
      "Review": "C++ How to Program presents leading-edge computing technologies in a friendly manner appropriate for introductory college course sequences, based on the curriculum recommendations of two key professional organizations–the ACM and the IEEE.",
      "Price": "12.35",
      "Book Type": "Paperback",
      "Book Pages": "1536",
      "Author": "Paul J. Deitel",
      "Language": "English",
      "Bio": "Paul Deitel has taught Visual Basic, Java, C and C++ at numerous hardware and software companies, including Sun Microsystems, Digital Equipment Corporation, IBM, Open Environment Corporation, Adra Systems, and Cambridge Technology Partners, and is himself an expert developer.",
      "img": "C++_how_to_program.png"
    },
    {
      "Title": "College Algera",
      "ISBN": "0470648015",
      "Genre": "Mathematics",
      "Publish Date": "Oct. 2 2012",
      "Publisher": "Wiley",
      "Review": "The 3rd edition of Cynthia Young's College  Algebra brings together all the elements that have  allowed instructors and learners to successfully \"bridge the gap\"  between classroom instruction and independent homework by  overcoming common learning barriers and building confidence in  students' ability to do mathematics. Written in a clear, voice that speaks to students and mirrors how instructors communicate in lecture, Young's hallmark pedagogy enables students to become independent, successful learners. ",
      "Price": "138.74",
      "Book Type": "Hardcover",
      "Book Pages": "976",
      "Author": "Cynthia Y. Young",
      "Language": "English",
      "Bio": "Cynthia Young is a Florida native who has lived in Broward, Palm Beach, and Leon counties. She previously collaborated with Catherine Cole on Haunted Florida (978-0-8117-3498-1).",
      "img": "college_algera.jpg"
    },
    {
      "Title": "The Sea Inside",
      "ISBN": "1612193595",
      "Genre": "Non-Fiction",
      "Publish Date": "April 29 2014",
      "Publisher": "Melville House",
      "Review": "In his fascinating travelogue… Hoare has adopted the Sebald approach, complete with text-embedded photographs and artwork, as he wanders around and across a variety of seas from England to New Zealand in search of their tales, lore, history, ecology, biological complexity and elusive beauty.",
      "Price": "25.19",
      "Book Type": "Hardcover",
      "Book Pages": "384",
      "Author": "Philip Hoare",
      "Language": "English",
      "Bio": "Philip Hoare lives and works in Southampton, England. He is the author of The Whale: In Search of the Giants of the Sea, winner of the BBC Samuel Johnson Prize for Nonfiction, as well as biographies of Noel Coward, Stephen Tennant, and a study of Oscar Wilde. He is Senior Lecturer in Creative Writing at the University of Southampton; artist in residence at the Marine Institute, Plymouth University; and cocurator of the Moby-Dick Big Read. Follow him on Twitter at @philipwhale.",
      "img": "The_sea_inside.jpg"
    },
    {
      "Title": "Python Crash Course: A Hands-On, Project-Based Introduction to Programming",
      "ISBN": "1593276036",
      "Genre": "Technology",
      "Publish Date": "Nov. 1 2015",
      "Publisher": "No Starch Press",
      "Review": "Python Crash Course is a fast-paced, thorough introduction to programming with Python that will have you writing programs, solving problems, and making things that work in no time. In the first half of the book, you'll learn about basic programming concepts, such as lists, dictionaries, classes, and loops, and practice writing clean and readable code with exercises for each topic. You'll also learn how to make your programs interactive and how to test your code safely before adding it to a project. In the second half of the book, you'll put your new knowledge into practice with three substantial projects: a Space Invaders-inspired arcade game, data visualizations with Python's super-handy libraries, and a simple web app you can deploy online.",
      "Price": "32.77",
      "Book Type": "Paperback",
      "Book Pages": "560",
      "Author": "Eric Matthes",
      "Language": "English",
      "Bio": "Eric Matthes is a high school math and science teacher living in Alaska who teaches an Introduction to Programming class in Python. He has been writing programs since he was five years old.",
      "img": "Python_Crash_Course.jpg"
    },
    {
      "Title": "Effective Java (2nd Edition)",
      "ISBN": "0321356683",
      "Genre": "Technology",
      "Publish Date": "May 8 2008",
      "Publisher": "Addison-Wesley",
      "Review": "Are you looking for a deeper understanding of the Java™ programming language so that you can write code that is clearer, more correct, more robust, and more reusable? Look no further! Effective Java™, Second Edition, brings together seventy-eight indispensable programmer’s rules of thumb: working, best-practice solutions for the programming challenges you encounter every day.",
      "Price": "18.16",
      "Book Type": "Paperback",
      "Book Pages": "384",
      "Author": "Joshua Bloch",
      "Language": "English",
      "Bio": "oshua Bloch is chief Java architect at Google and a Jolt Award winner. He was previously a distinguished engineer at Sun Microsystems and a senior systems designer at Transarc. Bloch led the design and implementation of numerous Java platform features, including JDK 5.0 language enhancements and the award-winning Java Collections Framework. He coauthored Java™ Puzzlers (Addison-Wesley, 2005) and Java™ Concurrency in Practice (Addison-Wesley, 2006).",
      "img": "Effective_Java_.jpg"
    },
    {
      "Title": "Web Design with HTML, CSS, JavaScript and jQuery Set",
      "ISBN": "1118907442",
      "Genre": "Technology",
      "Publish Date": "July 8 2014",
      "Publisher": "Wiley",
      "Review": "This two-book set combines the titles HTML & CSS: Designing and Building Web Sites and JavaScript & jQuery: Interactive Front-End Development. Together these two books form an ideal platform for anyone who wants to master HTML and CSS before stepping up to JavaScript and jQuery. HTML & CSS covers structure, text, links, images, tables, forms, useful options, adding style with CSS, fonts, colors, thinking in boxes, styling lists and tables, layouts, grids, and even SEO, Google analytics, ftp, and HTML5. JavaScript & jQuery offers an excellent combined introduction to these two technologies using a clear and simple visual approach using diagrams, infographics, and photographs.",
      "Price": "48.75",
      "Book Type": "Paperback",
      "Book Pages": "1152",
      "Author": "Jon Duckett",
      "Language": "English",
      "Bio": "Jon Duckett has been designing and building web sites for over a decade, working with global brands, and has authored and co-authored over a dozen books on web design, programming, usability and accessibility. He has curated conferences about web programming and has been a web strategy consultant, often coding front ends for projects and designing architectures for back end programming. He is the author of the best-selling, HTML & CSS: Design and Build Websites and JavaScript & jQuery: Interactive Front-End Web Development.",
      "img": "JavaScript_and_jQuery_.jpg"
    },
    {
      "Title": "JavaScript: The Good Parts",
      "ISBN": "0596517742",
      "Genre": "Technology",
      "Publish Date": "July 8 2014",
      "Publisher": "Yahoo Press",
      "Review": "Most programming languages contain good and bad parts, but JavaScript has more than its share of the bad, having been developed and released in a hurry before it could be refined. This authoritative book scrapes away these bad features to reveal a subset of JavaScript that's more reliable, readable, and maintainable than the language as a whole—a subset you can use to create truly extensible and efficient code.",
      "Price": "34.41",
      "Book Type": "Paperback",
      "Book Pages": "172",
      "Author": "Douglas Crockford",
      "Language": "English",
      "Bio": "Douglas Crockford is a Senior JavaScript Architect at Yahoo!, well known for introducing and maintaining the JSON (JavaScript Object Notation) format. He's a regular speaker at conferences on advanced JavaScript topics, and serves on the ECMAScript committee.",
      "img": "JavaScript-The_Good_Parts_.jpg"
    },
    {
      "Title": "The Immortal Life of Henrietta Lacks",
      "ISBN": "1400052181",
      "Genre": "Non-Fiction",
      "Publish Date": "March 8 2011",
      "Publisher": "Broadway Books",
      "Review": "Her name was Henrietta Lacks, but scientists know her as HeLa. She was a poor black tobacco farmer whose cells—taken without her knowledge in 1951—became one of the most important tools in medicine, vital for developing the polio vaccine, cloning, gene mapping, and more. Henrietta's cells have been bought and sold by the billions, yet she remains virtually unknown, and her family can't afford health insurance. This phenomenal New York Times bestseller tells a riveting story of the collision between ethics, race, and medicine; of scientific discovery and faith healing; and of a daughter consumed with questions about the mother she never knew.",
      "Price": "18.82",
      "Book Type": "Paperback",
      "Book Pages": "400 ",
      "Author": "Rebecca Skloot",
      "Language": "English",
      "Bio": "REBECCA SKLOOT is an award-winning science writer whose work has appeared in The New York Times Magazine; O, The Oprah Magazine; Discover; and many others. She is coeditor of The Best American Science Writing 2011 and has worked as a correspondent for NPR’s Radiolab and PBS’s Nova ScienceNOW. She was named one of five surprising leaders of 2010 by the Washington Post. Skloot's debut book, The Immortal Life of Henrietta Lacks, took more than a decade to research and write, and instantly became a New York Times bestseller. It was chosen as a best book of 2010 by more than sixty media outlets, including Entertainment Weekly, People, and the New York Times. It is being translated into more than twenty-five languages, adapted into a young reader edition, and being made into an HBO film produced by Oprah Winfrey and Alan Ball. Skloot is the founder and president of The Henrietta Lacks Foundation. She has a B.S. in biological sciences and an MFA in creative nonfiction. She has taught creative writing and science journalism at the University of Memphis, the University of Pittsburgh, and New York University. She lives in Chicago. For more information, visit her website at RebeccaSkloot.com, where you’ll find links to follow her on Twitter and Facebook. ",
      "img": "The_Immortal_Life_of_Henrietta_Lacks.jpg"
    },
    {
      "Title": "The Double Helix: A Personal Account of the Discovery of the Structure of DNA",
      "ISBN": "074321630X",
      "Genre": "Non-Fiction",
      "Publish Date": "June 12 2001",
      "Publisher": "Touchstone",
      "Review": "The classic personal account of Watson and Crick’s groundbreaking discovery of the structure of DNA, now with an introduction by Sylvia Nasar, author of A Beautiful Mind. By identifying the structure of DNA, the molecule of life, Francis Crick and James Watson revolutionized biochemistry and won themselves a Nobel Prize. At the time, Watson was only twenty-four, a young scientist hungry to make his mark. His uncompromisingly honest account of the heady days of their thrilling sprint against other world-class researchers to solve one of science’s greatest mysteries gives a dazzlingly clear picture of a world of brilliant scientists with great gifts, very human ambitions, and bitter rivalries.",
      "Price": "21.77",
      "Book Type": "Paperback",
      "Book Pages": "256",
      "Author": "James D. Watson Ph.D.",
      "Language": "English",
      "Bio": "James D. Watson, together with Francis Crick and Maurice Wilkins, was awarded the Nobel Prize for Physiology or Medicine in 1962. He is Chancellor Emeritus of the Watson School of Biological Sciences at Cold Spring Harbor Laboratory.",
      "img": "The_Double_Helix.jpg"
    },
    {
      "Title": "In Cold Blood",
      "ISBN": "",
      "Genre": "Non-Fiction",
      "Publish Date": "Feb. 1 1994",
      "Publisher": "Vintage",
      "Review": "On November 15, 1959, in the small town of Holcomb, Kansas, four members of the Clutter family were savagely murdered by blasts from a shotgun held a few inches from their faces. There was no apparent motive for the crime, and there were almost no clues. As Truman Capote reconstructs the murder and the investigation that led to the capture, trial, and execution of the killers, he generates both mesmerizing suspense and astonishing empathy. In Cold Blood is a work that transcends its moment, yielding poignant insights into the nature of American violence.",
      "Price": "18.90",
      "Book Type": "Paperback",
      "Book Pages": "368",
      "Author": "Truman Capote",
      "Language": "English",
      "Bio": "Truman Capote was born September 30, 1924, in New Orleans. After his parents’ divorce, he was sent to live with relatives in Monroeville, Alabama. It was here he would meet his lifelong friend, the author Harper Lee. Capote rose to international prominence in 1948 with the publication of his debut novel, Other Voices, Other Rooms. Among his celebrated works are Breakfast at Tiffany’s, A Tree of Night, The Grass Harp, Summer Crossing, A Christmas Memory, and In Cold Blood, widely considered one of the greatest books of the twentieth century. Twice awarded the O. Henry Short Story Prize, Capote was also the recipient of a National Institute of Arts and Letters Creative Writing Award and an Edgar Award. He died August 25, 1984, shortly before his sixtieth birthday.",
      "img": "In_Cold_Blood.jpg"
    },
    {
      "Title": "Silent Spring",
      "ISBN": "061825305X",
      "Genre": "Science",
      "Publish Date": "Nov. 14 2003",
      "Publisher": "Houghton Mifflin Harcourt",
      "Review": "In his fascinating travelogue… Hoare has adopted the Sebald approach, complete with text-embedded photographs and artwork, as he wanders around and across a variety of seas from England to New Zealand in search of their tales, lore, history, ecology, biological complexity and elusive beauty.",
      "Price": "28.15",
      "Book Type": "Hardcover",
      "Book Pages": "400",
      "Author": "Rachel Carson",
      "Language": "English",
      "Bio": "Rachel Carson (1907-1964) spent most of her professional life as a marine biologist with the U.S. Fish and Wildlife Service. By the late 1950s, she had written three lyrical, popular books about the sea, including the best-selling The Sea Around Us, and had become the most respected science writer in America. She completed Silent Spring against formidable personal odds, and with it shaped a powerful social movement that has altered the course of history.",
      "img": "Silent_Spring.jpg"
    },
    {
      "Title": "When Breath Becomes Air",
      "ISBN": "081298840X",
      "Genre": "Non-Fiction",
      "Publish Date": "Jan. 12 2016",
      "Publisher": "Random House",
      "Review": "At the age of thirty-six, on the verge of completing a decade’s worth of training as a neurosurgeon, Paul Kalanithi was diagnosed with stage IV lung cancer. One day he was a doctor treating the dying, and the next he was a patient struggling to live. And just like that, the future he and his wife had imagined evaporated. When Breath Becomes Air chronicles Kalanithi’s transformation from a naïve medical student “possessed,” as he wrote, “by the question of what, given that all organisms die, makes a virtuous and meaningful life” into a neurosurgeon at Stanford working in the brain, the most critical place for human identity, and finally into a patient and new father confronting his own mortality.",
      "Price": "22.34",
      "Book Type": "Hardcover",
      "Book Pages": "256",
      "Author": "Paul Kalanithi",
      "Language": "English",
      "Bio": "Paul Kalanithi was a neurosurgeon and writer. He grew up in Kingman, Arizona, and graduated from Stanford University with a BA and MA in English literature and a BA in human biology. He earned an MPhil in history and philosophy of science and medicine from the University of Cambridge and graduated cum laude from the Yale School of Medicine, where he was inducted into the Alpha Omega Alpha national medical honor society. He returned to Stanford to complete his residency training in neurological surgery and a postdoctoral fellowship in neuroscience, during which he received the American Academy of Neurological Surgery’s highest award for research. He died in March 2015. He is survived by his large, loving family, including his wife, Lucy, and their daughter, Elizabeth Acadia.",
      "img": "When_Breath_Becomes_Air.jpg"
    },
    {
      "Title": "The Davinci Code",
      "ISBN": "0307474275",
      "Genre": "Fiction",
      "Publish Date": "March 31 2009",
      "Publisher": "Anchor",
      "Review": "As millions of readers around the globe have already discovered, The Da Vinci Code is a reading experience unlike any other. Simultaneously lightning-paced, intelligent, and intricately layered with remarkable research and detail, Dan Brown's novel is a thrilling masterpiece—from its opening pages to its stunning conclusion.",
      "Price": "11.60",
      "Book Type": "Paperback",
      "Book Pages": "624",
      "Author": "Dan Brown",
      "Language": "English",
      "Bio": "Dan Brown is the bestselling author of Digital Fortress, Angels & Demons, and Deception Point. He lives in New England.",
      "img": "the-da-vinci-code.jpg"
    },
    {
      "Title": "Nineteen Eighty Four",
      "ISBN": "0141036141",
      "Genre": "Fiction",
      "Publish Date": "July 29 2008",
      "Publisher": "Penguin UK",
      "Review": "His final masterpiece. Enthralling and indispensible for understanding modern history Timothy Garton Ash Right up there among my favourite books ... I read it again and again Margaret Atwood More relevant to today than almost any other book that you can think of Jo Brand One of the most shocking novels of the twentieth century Margaret Drabble The book of the twentieth century Ben Pimlott.",
      "Price": "10.31",
      "Book Type": "Paperback",
      "Book Pages": "336",
      "Author": "George Orwell",
      "Language": "English",
      "Bio": "Eric Arthur Blair (1903-1950), better known by his pen-name, George Orwell, was born in India, where his father worked for the Civil Service. An author and journalist, Orwell was one of the most prominent and influential figures in twentieth-century literature. His unique political allegory Animal Farm was published in 1945, and it was this novel, together with the dystopia of Nineteen Eighty-Four (1949), which brought him world-wide fame. His novels and non-fiction include Burmese Days, Down and Out in Paris and London, The Road to Wigan Pier and Homage to Catalonia.",
      "img": "Nineteen_Eighty_Four.jpg"
    },
    {
      "Title": "The Alchemist",
      "ISBN": "0061122416",
      "Genre": "Fiction",
      "Publish Date": "April 25, 1993",
      "Publisher": "HarperOne",
      "Review": "The Alchemist by Paulo Coelho continues to change the lives of its readers forever. With more than two million copies sold around the world, The Alchemist has established itself as a modern classic, universally admired. Paulo Coelho's masterpiece tells the magical story of Santiago, an Andalusian shepherd boy who yearns to travel in search of a worldly treasure as extravagant as any ever found. The story of the treasures Santiago finds along the way teaches us, as only a few stories can, about the essential wisdom of listening to our hearts, learning to read the omens strewn along life's path, and, above all, following our dreams.",
      "Price": "0.25",
      "Book Type": "Paperback",
      "Book Pages": "197",
      "Author": "Paulo Coelho",
      "Language": "English",
      "Bio": "The Brazilian author PAULO COELHO is considered one of the most influential authors of our times. His books have sold more than 165 million copies worldwide, have been released in 170 countries and been translated into 80 languages. Born in Rio de Janeiro in 1947, he soon discovered his vocation for writing. He worked as a director, theater actor, songwriter and journalist. His collaboration with Brazilian composer and singer Raúl Seixas gave some of the greatest classic rock songs in Brazil. In 1986, a special meeting led him to make the pilgrimage to Saint James Compostela (in Spain). The Road to Santiago was not only a common pilgrimage but a turning point in his existence. A year later, he wrote 'The Pilgrimage', an autobiographical novel that is considered the beginning of his career. ",
      "img": "The_Alchemist.jpg"
    },
    {
      "Title": "Brave New World",
      "ISBN": "0060850523",
      "Genre": "Fiction",
      "Publish Date": "October 18, 2006",
      "Publisher": "Harper Perennial",
      "Review": "Aldous Huxley's tour de force, Brave New World is a darkly satiric vision of a \"utopian\" future—where humans are genetically bred and pharmaceutically anesthetized to passively serve a ruling order. A powerful work of speculative fiction that has enthralled and terrified readers for generations, it remains remarkably relevant to this day as both a warning to be heeded as we head into tomorrow and as thought-provoking, satisfying entertainment.",
      "Price": "12.99",
      "Book Type": "Paperback",
      "Book Pages": "288",
      "Author": "Aldous Huxley & John Sutherland",
      "Language": "English",
      "Bio": "Aldous Huxley (1894-1963) is the author of the classic novels Island, Eyeless in Gaza, and The Genius and the Goddess, as well as such critically acclaimed nonfiction works as The Devils of Loudun, The Doors of Perception, and The Perennial Philosophy. Born in Surrey, England, and educated at Oxford, he died in Los Angeles.",
      "img": "Brave_New_World.jpg"
    },
    {
      "Title": "The Power",
      "ISBN": "0316547611",
      "Genre": "Fiction",
      "Publish Date": "October 10, 2017",
      "Publisher": "Little, Brown and Company",
      "Review": "In THE POWER, the world is a recognizable place: there's a rich Nigerian boy who lounges around the family pool; a foster kid whose religious parents hide their true nature; an ambitious American politician; a tough London girl from a tricky family. But then a vital new force takes root and flourishes, causing their lives to converge with devastating effect. Teenage girls now have immense physical power--they can cause agonizing pain and even death. And, with this small twist of nature, the world drastically resets.",
      "Price": "18.20",
      "Book Type": "Hardcover",
      "Book Pages": "400",
      "Author": "Naomi Alderman",
      "Language": "English",
      "Bio": "Naomi Alderman is the author of The Liars' Gospel and Disobedience, which won the Orange Prize for New Writers, has been published in 10 languages, and is being made into a film by Rachel Weisz. She was selected for Granta's once-a-decade list of Best of Young British Novelists and was chosen by Margaret Atwood to be part of the Rolex Mentor and Protégé Arts Initiative. She is the co-creator and lead writer of the bestselling smartphone audio adventure app, Zombies, Run! She contributes regularly to the Guardian and presents Science Stories on BBC Radio 4. She lives in London.",
      "img": "The_Power.jpg"
    },
    {
      "Title": "A Brief History of Time",
      "ISBN": "0553380168",
      "Genre": "Science",
      "Publish Date": "Sept. 1 1998",
      "Publisher": "Bantam",
      "Review": "In the ten years since its publication in 1988, Stephen Hawking's classic work has become a landmark volume in scientific writing, with more than nine million copies in forty languages sold worldwide. That edition was on the cutting edge of what was then known about the origins and nature of the universe. But the intervening years have seen extraordinary advances in the technology of observing both the micro- and the macrocosmic worlds. ",
      "Price": "18.00",
      "Book Type": "Paperback",
      "Book Pages": "240",
      "Author": "Stephen Hawking",
      "Language": "English",
      "Bio": "Stephen William Hawking CH CBE FRS FRSA was an English theoretical physicist, cosmologist, author, and director of research at the Centre for Theoretical Cosmology at the University of Cambridge.",
      "img": "A_Brief_History_of_Time.jpg"
    },
    {
      "Title": "Enlightenment Now: The Case for Reason, Science, Humanism, and Progress",
      "ISBN": "0525427570",
      "Genre": "Science",
      "Publish Date": "Feb. 13 2018",
      "Publisher": "Viking",
      "Review": "Is the world really falling apart? Is the ideal of progress obsolete? In this elegant assessment of the human condition in the third millennium, cognitive scientist and public intellectual Steven Pinker urges us to step back from the gory headlines and prophecies of doom, which play to our psychological biases. Instead, follow the data: In seventy-five jaw-dropping graphs, Pinker shows that life, health, prosperity, safety, peace, knowledge, and happiness are on the rise, not just in the West, but worldwide. This progress is not the result of some cosmic force. It is a gift of the Enlightenment: the conviction that reason and science can enhance human flourishing.",
      "Price": "27.97",
      "Book Type": "Paperback",
      "Book Pages": "576",
      "Author": "Steven Pinker",
      "Language": "English",
      "Bio": "Steven Pinker is the Harvard College Professor of Psychology at Harvard University. A two-time Pulitzer Prize finalist and the winner of many awards for his research, teaching, and books, he has been named one of Time's 100 Most Influential People in the World Today and Foreign Policy's 100 Global Thinkers.",
      "img": "Enlightenment_Now.jpg"
    },
    {
      "Title": "Surely You're Joking, Mr. Feynman",
      "ISBN": "0393316041",
      "Genre": "Science",
      "Publish Date": "April 1 1997",
      "Publisher": "WW Norton",
      "Review": "Richard Feynman, winner of the Nobel Prize in physics, thrived on outrageous adventures. Here he recounts in his inimitable voice his experience trading ideas on atomic physics with Einstein and Bohr and ideas on gambling with Nick the Greek; cracking the uncrackable safes guarding the most deeply held nuclear secrets; accompanying a ballet on his bongo drums; painting a naked female toreador. In short, here is Feynman's life in all its eccentric―a combustible mixture of high intelligence, unlimited curiosity, and raging chutzpah. Black-and-white photographs throughout",
      "Price": "0.01",
      "Book Type": "Paperback",
      "Book Pages": "352",
      "Author": "Richard P Feynman",
      "Language": "English",
      "Bio": "Richard P. Feynman was born in 1918 and grew up in Far Rockaway, New York. At the age of seventeen he entered MIT and in 1939 went to Princeton, then to Los Alamos, where he joined in the effort to build the atomic bomb. Following World War II he joined the physics faculty at Cornell, then went on to Caltech in 1951, where he taught until his death in 1988. He shared the Nobel Prize for physics in 1965, and served with distinction on the Shuttle Commission in 1986. A commemorative stamp in his name was issued by the U.S. Postal Service in 2005.^Ralph Leighton, Richard Feynman's great friend and collaborator, now lives in northern California.",
      "img": "Surely_You_re_Joking_Mr_Feynman.jpg"
    },
    {
      "Title": "What Is Mathematics?: An Elementary Approach to Ideas and Methods",
      "ISBN": "0195105192",
      "Genre": "Mathematics",
      "Publish Date": "April 30 1999",
      "Publisher": "Oxford University Press",
      "Review": "For more than two thousand years a familiarity with mathematics has been regarded as an indispensable part of the intellectual equipment of every cultured person. Today, unfortunately, the traditional place of mathematics in education is in grave danger. The teaching and learning of mathematics has degenerated into the realm of rote memorization, the outcome of which leads to satisfactory formal ability but does not lead to real understanding or to greater intellectual independence. This new edition of Richard Courant's and Herbert Robbins's classic work seeks to address this problem. Its goal is to put the meaning back into mathematics. Written for beginners and scholars, for students and teachers, for philosophers and engineers, What is Mathematics?, Second Edition is a sparkling collection of mathematical gems that offers an entertaining and accessible portrait of the mathematical world.",
      "Price": "29.87",
      "Book Type": "Paperback",
      "Book Pages": "592",
      "Author": "Richard Courant & Herbert Robbins",
      "Language": "English",
      "Bio": "The late Richard Courant, headed the Department of Mathematicas at New York University and was Director of the Institute of Mathematical Sciences--which has subsequently renamed the Courant Institute of Mathematical Sciences. His book Mathematical Physics is familiar to every physicist, and his book Differential and Integral Calculus is acknowledged to be one of the best presentations of the subject written in modern times. Herbert Robbins is New Jersey Professor of Mathematical Statistics at Rutgers University. Ian Stewart is Professor of Mathematics at the University of Warwick, and author of Nature's Numbers and Does God Play Dice?. He also writes the \"Mathematical Recreations\" column in Scientific American.",
      "img": "What_Is_Mathematics.jpg"
    },
    {
      "Title": "How to Solve It: A New Aspect of Mathematical Method",
      "ISBN": "069111966X",
      "Genre": "Mathematics",
      "Publish Date": "Sept. 25 2015",
      "Publisher": "Princeton University Press",
      "Review": "A perennial bestseller by eminent mathematician G. Polya, How to Solve It will show anyone in any field how to think straight. In lucid and appealing prose, Polya reveals how the mathematical method of demonstrating a proof or finding an unknown can be of help in attacking any problem that can be \"reasoned\" out--from building a bridge to winning a game of anagrams. Generations of readers have relished Polya's deft--indeed, brilliant--instructions on stripping away irrelevancies and going straight to the heart of the problem.",
      "Price": "9.90",
      "Book Type": "Paperback",
      "Book Pages": "288",
      "Author": "G. Polya",
      "Language": "English",
      "Bio": "George Polya (1887-1985) was one of the most influential mathematicians of the twentieth century. His basic research contributions span complex analysis, mathematical physics, probability theory, geometry, and combinatorics. He was a teacher par excellence who maintained a strong interest in pedagogical matters throughout his long career. Even after his retirement from Stanford University in 1953, he continued to lead an active mathematical life. He taught his final course, on combinatorics, at the age of ninety. John H. Conway is professor emeritus of mathematics at Princeton University. He was awarded the London Mathematical Society's Polya Prize in 1987. Like Polya, he is interested in many branches of mathematics, and in particular, has invented a successor to Polya's notation for crystallographic groups.",
      "img": "How_to_Solve_It.jpg"
    },
    {
      "Title": "A Mind for Numbers: How to Excel at Math and Science (Even If You Flunked Algebra)",
      "ISBN": "039916524X",
      "Genre": "Mathematics",
      "Publish Date": "July 31 2014",
      "Publisher": "TarcherPerigee",
      "Review": "Whether you are a student struggling to fulfill a math or science requirement, or you are embarking on a career change that requires a new skill set, A Mind for Numbers offers the tools you need to get a better grasp of that intimidating material. Engineering professor Barbara Oakley knows firsthand how it feels to struggle with math. She flunked her way through high school math and science courses, before enlisting in the army immediately after graduation. When she saw how her lack of mathematical and technical savvy severely limited her options—both to rise in the military and to explore other careers—she returned to school with a newfound determination to re-tool her brain to master the very subjects that had given her so much trouble throughout her entire life.",
      "Price": "17.06",
      "Book Type": "Paperback",
      "Book Pages": "336",
      "Author": "Barbara Oakley PhD",
      "Language": "English",
      "Bio": "Barbara Oakley is a professor of engineering at Oakland University in Rochester, Michigan. She has received many awards for her teaching, including the coveted National Science Foundation New Century Scholar Award.",
      "img": "A_Mind_for_Numbers.jpg"
    },
    {
      "Title": "Linear Algebra Done Right",
      "ISBN": "0387982582",
      "Genre": "Mathematics",
      "Publish Date": "Feb. 26 2004",
      "Publisher": "Springer",
      "Review": "This text for a second course in linear algebra, aimed at math majors and graduates, adopts a novel approach by banishing determinants to the end of the book and focusing on understanding the structure of linear operators on vector spaces. The author has taken unusual care to motivate concepts and to simplify proofs. For example, the book presents - without having defined determinants - a clean proof that every linear operator on a finite-dimensional complex vector space has an eigenvalue. The book starts by discussing vector spaces, linear independence, span, basics, and dimension. Students are introduced to inner-product spaces in the first half of the book and shortly thereafter to the finite- dimensional spectral theorem. A variety of interesting exercises in each chapter helps students understand and manipulate the objects of linear algebra. This second edition features new chapters on diagonal matrices, on linear functionals and adjoints, and on the spectral theorem; some sections, such as those on self-adjoint and normal operators, have been entirely rewritten; and hundreds of minor improvements have been made throughout the text.",
      "Price": "49.51",
      "Book Type": "Paperback",
      "Book Pages": "251",
      "Author": "Sheldon Axler",
      "Language": "English",
      "Bio": "Sheldon Jay Axler is an American mathematician, professor of mathematics and the Dean of the College of Science and Engineering at San Francisco State University",
      "img": "Linear_Algebra_Done_Right.jpg"
    }
  ]
}
